Repository: conestack/cone.ldap
Catalog: src/cone/ldap/locale/*/LC_MESSAGES/cone.ldap.po
Languages: de

# delete_user_from_database
source: Deleted user '${uid}' from database.
de: Benutzer '${uid}' gelöscht.

# added_user_to_group
source: Added user '${uid}' to group '${gid}'.
de: Benutzer '${uid}' zu Gruppe '${gid}' hinzugefügt.

# lm_add_target_gid_not_allowed
source: Failed adding user '${uid}' to group '${gid}'. Manage membership denied for target group.
de: Hinzufügen von Benutzer '${uid}' zu Gruppe '${gid}' fehlgeschlagen. Administration Gruppe nicht erlaubt.

# removed_user_from_group
source: Removed user '${uid}' from group '${gid}'.
de: Benutzer '${uid}' aus Gruppe '${gid}' entfernt.

# lm_remove_target_gid_not_allowed
source: Failed removing user '${uid}' from group '${gid}'. Manage membership denied for target group.
de: Entfernen von Benutzer '${uid}' aus Gruppe '${gid}' fehlgeschlagen. Administration Gruppe nicht erlaubt.

# lm_remove_target_gid_is_default
source: Failed removing user '${uid}' from group '${gid}'. Target group is default group of user.
de: Entfernen von Benutzer '${uid}' aus Gruppe '${gid}' fehlgeschlagen. Gruppe is Standardgruppe für Benutzer.

# deleted_group
source: Deleted group from database
de: Gruppe gelöscht

# lm_add_target_uid_not_allowed
source: Failed adding user '${uid}' to group '${gid}'. Manage membership denied for user.
de: Hinzufügen von Benutzer '${uid}' zu Gruppe '${gid}' fehlgeschlagen. Administration Benutzer nicht erlaubt.

# lm_remove_target_uid_not_allowed
source: Failed removing user '${uid}' from group '${gid}'. Manage membership denied for user.
de: Entfernen von Benutzer '${uid}' aus Gruppe '${gid}' fehlgeschlagen. Administration Benutzer nicht erlaubt.

source: auto incremented
de: automatisch

source: Active
de: Aktiv

source: Add Group
de: Gruppe hinzufügen

source: Add user to selected group
de: Benutzer zu Gruppe hinzufügen

source: Remove user from selected group
de: Benutzer aus Gruppe entfernen

# group_already_exists
source: Group ${gid} already exists.
de: Gruppe ${gid} existiert bereits.

source: Delete Group
de: Gruppe löschen

source: Delete Principal
de: Benutzer/Gruppe löschen

source: Save
de: Speichern

source: Cancel
de: Abbrechen

source: Roles
de: Rollen

# cannot_create_container
source: Can't create container: ${error}
de: Kann Knoten nicht erstellen: ${error}

source: No container DN defined.
de: Kein DN definiert

# expected_ou_as_rdn
source: Expected 'ou' as RDN Attribute.
de: 'ou' als RDN Attribut erwartet

source: Invalid DN.
de: Ungültiger DN

# parent_not_found
source: Parent not found. Can't continue.
de: Elternelement nicht gefunden. Abbruch

# created_principal_container
source: Created ${rdn}
de: ${rdn} erstellt

# server_down
source: Down
de: Nicht erreichbar

source: Inexistent
de: Nicht existent

# localmanager_duplicate_rule_error
source: Duplicate access rule
de: Doppelte Zugriffsregel definiert

# localmanager_target_is_source_error
source: Target GID equates source GID
de: Ziel GID entspricht Administrations GID

source: Add User
de: Benutzer hinzufügen

# user_already_exists
source: User ${uid} already exists.
de: Benutzer ${uid} existiert bereits.

# user_login_not_unique
source: User login ${login} not unique.
de: Login name ${login} nicht eindeutig

source: Delete User
de: Benutzer löschen

# sort_by
source: Sorting
de: Sortieren

# group_settings
source: Groups Settings
de: Gruppeneinstellungen

source: Check Groups DN:
de: Prüfe Gruppen DN

source: Server not reachable
de: Server nich erreichbar

source: Create groups container?
de: Knoten für Gruppen erstellen?

# create_groups_container_description
source: The groups container DN does not exist. The Application can try to create it. This only works if the parent entry of defined DN exists. The groups container will be created with objectClass 'organizationalUnit'. Thus, the RDN name of DN must be 'ou'.
de: Knoten für Gruppen existiert nicht. Das Programm kann versuchen den Knoten zu erstellen. Das funktioniert nur wenn der Elternknoten des zu erstellenden Knotens existiert. Der neue Knoten wird mit der Objektklasse 'organizationalUnit' erstellt, das muss im DN berücksichtigt werden

source: Create groups container now
de: Gruppenknoten erstellen

source: Available
de: Verfügbar

source: Recent
de: Zugewiesen

# localmanager_disabled_warning
source: Local User Management is not enabled.
de: Lokale Benutzeradministration ist deaktiviert

source: List all
de: Alle anzeigen

source: Roles Settings
de: Rolleneinstellungen

source: Check Roles DN:
de: Prüfe Rollen DN

source: Create roles container?
de: Knoten für Rollen erstellen?

# create_roles_container_description
source: The roles container DN does not exist. The Application can try to create it. This only works if the parent entry of defined DN exists. The roles container will be created with objectClass 'organizationalUnit'. Thus, the RDN name of DN must be 'ou'.
de: Knoten für Rollen existiert nicht. Das Programm kann versuchen den Knoten zu erstellen. Das funktioniert nur wenn der Elternknoten des zu erstellenden Knotens existiert. Der neue Knoten wird mit der Objektklasse 'organizationalUnit' erstellt, das muss im DN berücksichtigt werden

source: Create roles container now
de: Rollenknoten erstellen

source: LDAP Server Settings
de: LDAP Server Einstellungen

source: Server Connection:
de: Verbindung zum Server

source: Users Settings
de: Benutzereinstellungen

source: Check Users DN:
de: Prüfe Benutzer DN

source: Create users container?
de: Knoten für Benutzer erstellen?

# create_users_container_description
source: The users container DN does not exist. The Application can try to create it. This only works if the parent entry of defined DN exists. The users container will be created with objectClass 'organizationalUnit'. Thus, the RDN name of DN must be 'ou'.
de: Knoten für Benutzer existiert nicht. Das Programm kann versuchen den Knoten zu erstellen. Das funktioniert nur wenn der Elternknoten des zu erstellenden Knotens existiert. Der neue Knoten wird mit der Objektklasse 'organizationalUnit' erstellt, das muss im DN berücksichtigt werden

source: Create users container now
de: Benutzerknoten erstellen

# group_node
source: Group
de: Gruppe

# group_node_description
source: Group
de: Gruppe

# groups_node
source: Groups
de: Gruppen

# groups_node_description
source: Container for Groups
de: Gruppencontainer

# ldap_settings_node
source: UGM Settings
de: UGM Einstellungen

# ldap_settings_node_description
source: General user and group management settings
de: Allgemeine Benutzer- und Gruppeneinstellungen

# ldap_props_node
source: LDAP Props
de: LDAP Einstellungen

# ldap_props_node_description
source: LDAP properties
de: LDAP Einstellungen

# user_settings_node
source: Users Settings
de: Benutzereinstellungen

# user_settings_node_description
source: LDAP users settings
de: LDAP Benutzereinstellungen

# group_settings_node
source: Groups Settings
de: Gruppeneinstellungen

# group_settings_node_description
source: LDAP groups settings
de: LDAP Gruppeneinstellungen

# role_settings_node
source: Roles Settings
de: Rolleneinstellungen

# role_settings_node_description
source: LDAP roles settings
de: LDAP Rolleneinstellungen

# localmanager_settings_node
source: Local Manager Settings
de: Benutzeradmin

# localmanager_settings_node_description
source: Local Manager Settings
de: Benutzeradmin

# user_node
source: User
de: Benutzer

# user_node_description
source: User
de: Benutzer

# users_node
source: Users
de: Benutzer

# users_node_description
source: Container for Users
de: Benutzercontainer

source: filter listing
de: Liste filtern

source: Default membership assignment widget
de: Standard Widget für Benutzer- und Gruppenmitgliedschaft

source: User display name attribute
de: Anzeigename für Benutzer

source: Group display name attribute
de: Anzeigename für Gruppen

source: User Accounts expires?
de: Benutzer läuft ab?

# user_accounts_expires_help
source: Flag whether to consider user expiration
de: Benutzerkonten können ein Ablaufdatum haben

source: Attribute containing expiration Time
de: Ablaufdatum LDAP Attribut

# attribute_containing_expiration_time_help
source: LDAP attribute name containing expires information
de: LDAP Attribut welches das Ablaufdatum enthält

source: Account expiration unit
de: Format Ablaufdatum

# account_expiration_unit_help
source: Unit of expiration value
de: Format des Ablaufdatum

source: Autoincrement user id
de: Benutzer ID's automatisch inkrementieren

# autoincrement_user_id_help
source: Flag whether to autoincrement user ids at user creation time. This feature only works for systems using numeric user ID's
de: Mit dieser Option werden neue Benutzer ID's automatisch hochgezählt

source: Autoincrement user id prefix
de: Präfix für automatische Benutzer ID's

# autoincrement_user_id_prefix_help
source: Prefix for autogenerated user ID's
de: Wird als Präfix der neuen Benutzer ID vorangestellt

source: Autoincrement initial user number
de: Start ID Benutzer

# autoincrement_initial_user_number_help
source: User number to start from
de: Erste verwendete Nummer für neue Benutzer

source: Portrait Support
de: Portrait Unterstützung

# portrait_support_help
source: Flag whether users can have a portrait
de: Benutzer können ein Portrait haben

source: Attribute containing portrait image
de: Portrait Attribut

# attribute_containing_portrait_image_help
source: LDAP attribute name containing portrait image
de: Attribut Name in dem das Portrait gespeichert ist

# portrait_mimetype_help
source: Accepted Image mimetype for portrait property
de: Mimetype des Portrait Bildes

source: Portrait width
de: Portrait Breite

# portrait_width_help
source: Width in pixel portrait gets scaled to
de: Portrait Breite in Pixel. Bild wird auf diese Breite skaliert bzw zugeschnitten

source: Portrait height
de: Portrait Höhe

# portrait_height_help
source: Height in pixel portrait gets scaled to
de: Portrait Höhe in Pixel. Bild wird auf diese Höhe skaliert bzw zugeschnitten

# users_local_management_enabled
source: Local User Management
de: Benutzeradmin

# users_local_management_enabled_help
source: Enable local User Management
de: Lokale Benutzeradministration aktivieren

source: Groups container DN
de: Gruppen DN

# groups_container_dn_required
source: No Groups DN defined
de: Kein DN für Gruppen angegeben

source: Groups search scope
de: Gruppen Suchbereich

source: Groups search query filter
de: Guppensuche Filter

source: Object classes for Group creation
de: LDAP Objektklassen für neue Gruppen

source: Group attribute aliases
de: Reservierte Attribute

# group_attribute_aliases_required
source: Group attribute aliases values are mandatory
de: Attribute sind erforderlich

source: Reserved key
de: Reserviertes Attribut

source: LDAP attr name
de: LDAP Attributname

source: Group form attributes
de: Attribute Gruppenformular

source: Form label
de: Beschriftung im Gruppenformular

source: Column configuration for groups listings
de: Spalten für Gruppenliste

# column_configuration_for_groups_listings_required
source: Column configuration for group listings value is mandatory
de: Spalten für Gruppenliste sind erforderlich

source: Attr name
de: Attributname

source: Display name
de: Anzeigename

source: Groups listing default column
de: Gruppenliste Standard Spalte (Sortierung)

source: Roles container DN
de: Rollen DN

# roles_container_dn_required
source: No Roles DN defined
de: Kein DN für Rollen angegeben

source: Roles search scope
de: Rollen Suchbereich

source: Roles search query filter
de: Rollensuche Filter

# roles_object_classes
source: Object classes for Role creation
de: LDAP Objektklassen für neue Rollen

source: Role attribute aliases
de: Reservierte Attribute

# role_attribute_aliases_required
source: Role attribute aliases values are mandatory
de: Attribute sind erforderlich

source: Role form attributes
de: Attribute Rollenformular

# ldap_uri_required
source: No URI defined
de: Keine URI angegeben

source: LDAP Manager User
de: LDAP Administrator Benutzer

# ldap_manager_user_required
source: No user defined
de: Kein Benutzer angegeben

source: LDAP Manager Password
de: LDAP Administrator Passwort

# ldap_manager_password_required
source: No password defined
de: Kein Passwort angegeben

source: Use cache for LDAP queries?
de: Benutze Cache für LDAP Anfragen?

source: Users container DN
de: Benutzer DN

# users_container_dn_help
source: LDAP DN of container with users
de: LDAP DN für Benutzer

# users_container_dn_required
source: No Users DN defined
de: Kein DN für Benutzer angegeben

source: Users search scope
de: Benutzer Suchbereich

# users_search_scope_help
source: LDAP Search scope for users
de: Suchbereich für Benutzer im LDAP Verzeichnis

source: Users search query filter
de: Benutzersuche Filter

# users_search_query_filter_help
source: Custom LDAP query for user objects
de: LDAP Suchfilter für Benutzersuche

# user_object_classes
source: Object classes for User creation
de: LDAP Objektklassen für neue Benutzer

# user_object_classes_help
source: LDAP object classes
de: Diese Objektklassen werden auf neuen Benutzern gesetzt bzw beim aktualisieren von Benutzern aktualisiert.

source: User attribute aliases
de: Reservierte Attribute

# user_attribute_aliases_help
source: Aliases for reserved attribute keys
de: Zuweisung für reservierte Attribute

# user_attribute_aliases_required
source: User attribute aliases values are mandatory
de: Reservierte Attribute sind erforderlich

source: User form attributes
de: Attribute Benutzerformular

# user_form_attributes_help
source: Attributes exposed in user form
de: Attribute welche im Benutzerformular angezeigt werden

source: Column configuration for user listings
de: Spalten für Benutzerliste

# column_configuration_for_user_listings_help
source: Attributes shown in user listing
de: Attribute welche in der Benutzerliste als Spalten angezeigt werden

# column_configuration_for_user_listings_required
source: Column configuration for user listings values are mandatory
de: Spalten für Benutzerliste sind erforderlich

source: Users listing default column
de: Benutzerliste Standard Spalte (Sortierung)

# users_listing_default_column_help
source: Default sort column in user listing
de: Standardsortierung Benutzerliste

# exposed_attributes_label
source: User attributes exposed to attribute map
de: Attribute für API

# exposed_attributes_array
source: Click '+' to add attributes
de: + klicken um Attribut hinzuzufügen

# exposed_attributes_help
source: Attributes which can be set via remote API
de: Attribute können über Remote API gesetzt werden

# exposed_attributes_attribute
source: Attribute
de: Attribut

# exposed_attributes_attribute_required
source: No attribute given
de: Kein Attribut angegeben

# localmanager_rules
source: Access rules
de: Zugriffsregeln

# localmanager_rule_source
source: Source GID
de: Administrations GID

# localmanager_rule_target
source: Target GID [default]
de: Ziel GID [Standard]

# localmanager_no_targets_for_source
source: No target GID's defined for source GID
de: Keine Ziel GID's für Administrations GID angegeben

# localmanager_source_empty
source: No source GID defined
de: Keine Administrations GID angegeben

# localmanager_target_empty
source: No target GID defined
de: Keine Ziel GID angegeben
